Documents/ВнутреннееПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВнутреннееПеремещениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.ЗаявкаНаПеремещениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКВыплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПолучатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйКонтролироватьЗаполнениеЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_АдресФактическогоПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетЗамеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверятьПересечениеЗамеровВГрафике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортАдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифМонтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифыИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветМеткиЗамераНаКартеЯндекс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаМетокЯндексКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВыполняемыхНормоЧасовМонтажаЗаЧасВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВнутреннееПеремещениеДенежныхСредств/Ext/ManagerModule.bsl
// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВнутреннееПеремещениеДенежныхСредств";
	КомандаПечати.Идентификатор = "ПеремещениеДенежныхСредств";
	КомандаПечати.Представление = НСтр("ru = 'Квитанция на внутреннее перемещение денежных средств'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 1;	
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.ПолноеНаименование <> """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.Организация.ИНН КАК ОрганизацияИНН,
	|	ДанныеДокумента.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеДокумента.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ОрганизацияПолучатель.ПолноеНаименование <> """"
	|			ТОГДА ДанныеДокумента.ОрганизацияПолучатель.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.ОрганизацияПолучатель.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизацияПолучатель,
	|	ДанныеДокумента.ОрганизацияПолучатель.ИНН КАК ОрганизацияПолучательИНН,
	|	ДанныеДокумента.ОрганизацияПолучатель.КПП КАК ОрганизацияПолучательКПП,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.КассаОтправитель КАК КассаОтправитель,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.КассаОтправитель) КАК ПредставлениеКассаОтправитель,
	|	ДанныеДокумента.КассаПолучатель КАК КассаПолучатель,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.КассаПолучатель) КАК ПредставлениеКассаПолучатель,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.Статья КАК Статья,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.Организация.Руководитель КАК ФИОРуководителя,
	|	ДанныеДокумента.ОрганизацияПолучатель.Руководитель КАК ФИОРуководителяПолучателя,
	|	ДанныеДокумента.Организация.ГлавныйБухгалтер КАК ФИОГлавногоБухгалтера,
	|	ДанныеДокумента.ОрганизацияПолучатель.ГлавныйБухгалтер КАК ФИОГлавногоБухгалтераПолучателя,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.Кассир = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Автор.Сотрудник
	|		ИНАЧЕ ДанныеДокумента.Организация.Кассир
	|	КОНЕЦ КАК Кассир,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ОрганизацияПолучатель.Кассир = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Автор.Сотрудник
	|		ИНАЧЕ ДанныеДокумента.ОрганизацияПолучатель.Кассир
	|	КОНЕЦ КАК КассирПолучателя
	|ИЗ
	|	Документ.ВнутреннееПеремещениеДенежныхСредств КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
		
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке", РезультатПоШапке);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПеремещениеДенежныхСредств") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПеремещениеДенежныхСредств",
		НСтр("ru = 'Перемещение денежных средств'"),
		СформироватьПечатнуюФормуВПДС(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ВнутреннееПеремещениеДенежныхСредств.ВПДС");
	КонецЕсли;	
КонецПроцедуры

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	РезультатЗапроса.Колонки.Добавить("ДатаДокумента", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	РезультатЗапроса.Колонки.Добавить("ДатаДокументаПрописью", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20)));
	РезультатЗапроса.Колонки.Добавить("СуммаПрописью", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ПредставлениеПодразделения",   Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ПредставлениеСтруктурногоПодразделения",   Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ПринятоОт",   Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ПринятоВ",   Новый ОписаниеТипов("Строка"));
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		
		ТекущаяСтрока.ДатаДокумента = Формат(ТекущаяСтрока.Дата, "ДЛФ=Д");
		ТекущаяСтрока.ДатаДокументаПрописью = Формат(ТекущаяСтрока.Дата, "ДЛФ=DD");
		ТекущаяСтрока.НомерДокумента = ТекущаяСтрока.Номер;
		//ТекущаяСтрока.СуммаПрописью = ЧислоПрописью(СсылкаНаОбъект.Сумма, ,"Рубль, рублей, рубля, м, копейка, копейки, копеек, ж, 2");
		ТекущаяСтрока.СуммаПрописью = РаботаСВалютой.СформироватьЧислоПрописьюВсп(ТекущаяСтрока.Сумма, ТекущаяСтрока.Валюта, "Л = ru_RU; ДП = Ложь");
		
		ТекущаяСтрока.ПредставлениеПодразделения = ТекущаяСтрока.ПредставлениеОрганизации + " (" + ТекущаяСтрока.ПредставлениеКассаОтправитель + ")";
		ТекущаяСтрока.ПредставлениеСтруктурногоПодразделения = ТекущаяСтрока.ПредставлениеПодразделения;
		ТекущаяСтрока.ПринятоОт = ТекущаяСтрока.ПредставлениеКассаОтправитель;
		ТекущаяСтрока.ПринятоВ = ТекущаяСтрока.ПредставлениеКассаПолучатель;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.ОрганизацияПолучатель);

	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуВПДС(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Макет = Документы.ВнутреннееПеремещениеДенежныхСредств.ПолучитьМакет("ПФ_MXL_ВПДС");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; 
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВнутреннееПеремещениеДенежныхСредств_ВПДС";
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати      = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		
		ОснованиеДляПечати = "";
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		
		ОбластьМакета.Параметры.Основание = ДанныеПечати.Основание;
		
		Руб = Цел(ДанныеПечати.Сумма);
		Коп = ОКР(100 * (ДанныеПечати.Сумма - Руб), 0, 1);
		Если ДанныеПечати.Валюта = Справочники.Валюты.RUB Тогда
			//RUB
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " коп.";
		ИначеЕсли ДанныеПечати.Валюта = Справочники.Валюты.BYR Тогда
			//BYR
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " коп.";
		ИначеЕсли ДанныеПечати.Валюта = Справочники.Валюты.UAH Тогда
			//UAH
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="гривна,гривны,гривен,ж,копейка,копейки,копеек,ж,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " коп.";
		ИначеЕсли ДанныеПечати.Валюта = Справочники.Валюты.EUR Тогда
			//EUR
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="евро,евро,евро,с,цент,цента,центов,м,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " центов";
		ИначеЕсли ДанныеПечати.Валюта = Справочники.Валюты.USD Тогда
			//USD
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="доллар,доллара,долларов,м,цент,цента,центов,м,2";
			
			ОбластьМакета.Параметры.СуммаРубКоп = "" + Руб + " "+ДанныеПечати.Валюта+" " + Цел(Коп/10) + (Коп - 10 * Цел(Коп / 10)) + " центов";
		КонецЕсли;
		
		ОбластьМакета.Параметры.СуммаПрописью = ЧислоПрописью(ДанныеПечати.Сумма, ФормСтрока, ПарПредмета);		
		
		ОбластьМакета.Параметры.ФИОКассира = ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Кассир);	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#Область СозданиеНаОсновании

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВнутреннееПеремещениеДенежныхСредств) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ВнутреннееПеремещениеДенежныхСредств.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ВнутреннееПеремещениеДенежныхСредств.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Запись";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти
